{"resume": "shantanu sharma\ndelhi,india|linkedin|github|portfoliowebsite|shantanu100.sharma@gmail.com|+91-9990193322\nworkexperience\nbectondickinson gurugram,india\ndataanalyst,strategy&transformationteam june2023–may2024\n● developedtime-seriesforecastingmodels(neuralprophet,xgboost)forpredictingproductinventory.\n● automateddataprocessingpipelinetominimizetimeandlaborupto50%,whileeliminatinghumanerror.\n● analyzedsupplychaindatatoprovidestakeholderswithactionableinsightsanddrivebusinessgrowth.\nedgeneural.ai pu", "jd": "data engineer (sql & python expertise required)\n\n\n 📅 experience: 0-2 years\n 🏢 company: cephei infotech\n 💼 job type: full-time\n\nabout us\ncephei infotech is a leading data & analytics-focused it company, delivering scalable data engineering, business intelligence, and ai-driven solutions. we help businesses unlock the power of data through robust pipelines, real-time analytics, and ai/ml innovations.\n\nrole overview\nwe are looking for a data engineer with 0-2 years of experience, proficient in sql ", "score": 46.15, "summary": " \"Highly skilled and ambitious Data Engineer with 0-2 years of experience in SQL and Python, demonstrated through numerous projects in machine learning, computer vision, and generative AI. Proven expertise in designing, developing, and optimizing ETL pipelines, data warehousing, and delivering scalable solutions. Strong problem-solving abilities and a fast-paced collaborative mindset, with a passion for data quality, integrity, and security. Seeking to leverage my skills in a dynamic, data-driven organization like Cephei Infotech to propel both my career growth and the company's AI/ML initiatives.\"", "feedback": " 1. Skills Missing:\n   * Experience with ETL tools like Apache Spark, Snowflake, or Databricks.\n   * Knowledge of big data platforms like Hadoop, Hive, or Kafka.\n   * Familiarity with cloud platforms like AWS, Azure, or GCP for data storage and management.\n\n2. Suggestions to Improve Resume:\n   * Tailor the resume specifically for the Data EngineerPosition, highlighting relevant skills and experiences.\n   * Add a section for achievements and quantifiable results, such as improving data processing time, increasing data quality, or reducing errors.\n   * Include a professional summary or objective statement that briefly outlines your career goals and relevant skills.\n\n3. Rewritten Resume Bullet:\n   Original: \"*leveraged reflection removal techniques and videostabilization using deep learning to improve data quality*.\"\n   Rewritten: \"*Improved the quality of video data by implementing deep learning-based reflection removal and stabilization techniques, resulting in a 20% reduction in errors and a 15% improvement in overall data quality.*\""}